Emacs.org
* My Minimal Emacs Configuration for Writing
:PROPERTIES:
:ID:       81dcbf2a-a270-4194-a49e-b8bddace3af9
:END:

#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes

* Disable welcome message 

First of all, I don't like the welcome messages.

#+begin_src emacs-lisp
  ;; no welcome messages
  (setq inhibit-startup-message t)
#+end_src

* Disable backup and autosave files

And I disable emacs to create backup and autosave files.

#+begin_src emacs-lisp
  ;; stop creating backup~ files
  (setq make-backup-files nil)
  ;; stop creating #autosave# files
  (setq auto-save-default nil)
#+end_src

* File encoding

#+begin_src emacs-lisp
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)
#+end_src

* Performance Testing

Increase memory for Emacs.

#+begin_src emacs-lisp
  (if (not (display-graphic-p))
      (progn
        ;; 增大垃圾回收的阈值，提高整体性能（内存换效率）
        (setq gc-cons-threshold (* 8192 8192 100))
        (setq read-process-output-max (* 1024 1024 256)) ;; 128MB
        ))
#+end_src

** Messure startup time

#+begin_src emacs-lisp
  (defun civ/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
              (format "%.2f seconds"
                      (float-time
                        (time-subtract after-init-time before-init-time)))
              gcs-done))

  (add-hook 'emacs-startup-hook #'civ/display-startup-time)
#+end_src

* Proxy settings

#+begin_src emacs-lisp
  (when (or (string-equal system-type "windows-nt") ; Microsoft Windows
            (string-equal system-type "gnu/linux"))
    (setq url-proxy-services
          '(("http"  . "127.0.0.1:51837")
            ("https" . "127.0.0.1:51837"))))
#+end_src

* Package System Setup

[[https://github.com/radian-software/straight.el#features][straight.el]] is a next-generation, purely functional package manager for Emacs.

#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

[[https://github.com/jwiegley/use-package][use-package]] is not a package manager, its primary purpose is for the configuration and loading of packages. We can make our configuration one place and use it everyelse.

#+begin_src emacs-lisp
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
  ;; Initialize package sources
  (require 'use-package)
#+end_src

** Automatic Package Updates

The auto-package-update package helps us keep our Emacs packages up to date!  It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.

You can also use =M-x auto-package-update-now= to update right now!

#+begin_src emacs-lisp
  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

* Keep .emacs.d Clean

I use the [[https://github.com/emacscollective/no-littering/blob/master/no-littering.el][no-littering]] package to keep folders where we edit files and the Emacs configuration folder clean!  It knows about a wide variety of variables for built in Emacs features as well as those from community packages so it can be much easier than finding and setting these variables yourself.

#+begin_src emacs-lisp

  ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
                                          ;(setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering)

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src


* User interface

** Toolbar, tooltip and menubar

Basically, I don't want to show the toolbar, menubar and tootips.

#+begin_src emacs-lisp
  ;; UI settings
  (scroll-bar-mode -1)	; Disable the scrollbar
  (tool-bar-mode -1)	; Disable the toolbar
  (tooltip-mode -1)	        ; Disable tooltips
  (set-fringe-mode 10)      ; Give some breathing room
  (menu-bar-mode -1)	; Disable the menu bar
#+end_src

** Make bell visible only

And, I find that the bell annoying.

#+begin_src emacs-lisp
  ;; Set up the visible bell
  (setq visible-bell t)
#+end_src

** Relative line number

For the modes except org-mode, term-mode and eshell-mode, I think showing the line number is a good choice. And it's relative!

#+begin_src emacs-lisp
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative)

  ;; Disable line numbers for some modes, dolist is used to loop
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

