init.el

(defun civ/font-existsp (font)
  (if (null (x-list-fonts font))
      nil t))

(defun civ/make-font-string (font-name font-size)
  (if (and (stringp font-size)
           (equal ":" (string (elt font-size 0))))
      (format "%s%s" font-name font-size)
    (format "%s-%s" font-name font-size)))

(defvar civ/english-font-size nil)
(defun civ/set-font (english-fonts
                     english-font-size
                     chinese-fonts
                     &optional chinese-fonts-scale
                     )
  (setq chinese-fonts-scale (or chinese-fonts-scale 1.20))
  (setq face-font-rescale-alist `(("Microsoft Yahei" . ,chinese-fonts-scale)
                                  ("Microsoft_Yahei" . ,chinese-fonts-scale)
                                  ("微软雅黑" . ,chinese-fonts-scale)
                                  ("WenQuanYi Zen Hei" . ,chinese-fonts-scale)))
  "english-font-size could be set to \":pixelsize=18\" or a integer.
  If set/leave chinese-font-size to nil, it will follow english-font-size"
  (require 'cl)                         ; for find if
  (setq civ/english-font-size english-font-size)
  (let ((en-font (civ/make-font-string
                  (find-if #'civ/font-existsp english-fonts)
                  english-font-size))
        (zh-font (font-spec :family (find-if #'civ/font-existsp chinese-fonts))))

    ;; Set the default English font
    ;;
    ;; The following 2 method cannot make the font settig work in new frames.
    ;; (set-default-font "Consolas:pixelsize=18")
    ;; (add-to-list 'default-frame-alist '(font . "Consolas:pixelsize=18"))
    ;; We have to use set-face-attribute
    (set-face-attribute
     'default nil :font en-font)
    (condition-case font-error
        (progn
          (set-face-font 'italic (font-spec :family "JetBrains Mono" :slant 'italic :weight 'normal :size (+ 0.0 english-font-size)))
          (set-face-font 'bold-italic (font-spec :family "JetBrains Mono" :slant 'italic :weight 'bold :size (+ 0.0 english-font-size)))

          (set-fontset-font t 'symbol (font-spec :family "JetBrains Mono")))
      (error nil))
    (set-fontset-font t 'symbol (font-spec :family "FiraCode Nerd Font") nil 'append)
    (set-fontset-font t nil (font-spec :family "DejaVu Sans"))

    ;; Set Chinese font
    ;; Do not use 'unicode charset, it will cause the english font setting invalid
    (dolist (charset '(kana han cjk-misc bopomofo))
      (set-fontset-font t charset zh-font)))
  )

(defvar civ/english-fonts '("JetBrains Mono" "Monaco" "Consolas" "DejaVu Sans Mono" "Monospace" "Courier New"))
(defvar civ/chinese-fonts '("Microsoft Yahei" "Microsoft_Yahei" "微软雅黑" "文泉驿等宽微米黑" "黑体" "新宋体" "宋体"))

(civ/set-font
 civ/english-fonts
 14
 civ/chinese-fonts)

(defvar civ/chinese-font-size-scale-alist nil)

(setq chinese-font-size-scale-alist '((12 . 1.25) (12.5 . 1.25) (14 . 1.20) (16 . 1.25) (20 . 1.20)))

(defvar civ/english-font-size-steps '(9 10.5 11.5 12 12.5 13 14 16 18 20 22 40))
(defun civ/step-frame-font-size (step)
  (let ((steps civ/english-font-size-steps)
        next-size)
    (when (< step 0)
      (setq steps (reverse civ/english-font-size-steps)))
    (setq next-size
          (cadr (member civ/english-font-size steps)))
    (when next-size
      (civ/set-font civ/english-fonts next-size civ/chinese-fonts (cdr (assoc next-size civ/chinese-font-size-scale-alist)))
      (message "Your font size is set to %.1f" next-size))))

(global-set-key [(control x) (meta -)] (lambda () (interactive) (civ/step-frame-font-size -1)))
(global-set-key [(control x) (meta +)] (lambda () (interactive) (civ/step-frame-font-size 1)))

(set-face-attribute 'default nil :font (font-spec))

;; install doom theme
(use-package doom-themes
  :config
  (load-theme 'doom-horizon t)
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

;; before using it, you should use `all-the-icons-install-fonts` to install the fonts
(use-package all-the-icons
  :if (display-graphic-p))

;; emacs air line
(use-package doom-modeline
  :hook (window-setup . doom-modeline-mode)
  :custom ((doom-modeline-height 15)))

;; highlight current line
(global-hl-line-mode 1)

(use-package emojify
  :hook (after-init . global-emojify-mode))

(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-banner-logo-title "This is Civitasv!")
  (setq dashboard-startup-banner 'logo)
  (setq dashboard-center-content nil)
  (setq dashboard-show-shortcuts t)
  (setq dashboard-items '((recents  . 5)
                          (bookmarks . 5)
                          (agenda . 5)
                          (registers . 5)))
  )
