Emacs.org
* Keybindings Configuration

I prefer to use Vi-like editing command, so I use the [[https://evil.readthedocs.io/en/latest/index.html][evil-mode]] to realize it.

[[https://github.com/emacs-evil/evil-collection][evil-collection]] is used to automatically configure various Emacs modes with Vi-like keybindings for evil-mode.

[[https://github.com/abo-abo/hydra][hydra.el]] is best to make keybindings that have same prefix.

[[https://github.com/noctuid/general.el][general.el]] is used to create keybindings easily.

#+begin_src emacs-lisp
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package hydra)

  ;; A hydra example:
  ;; When `hydra-text-scale/body` is invoked,
  ;; then j, k, f will appear, press j to increase text, press k to decrease text, presee f to finish.
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (defhydra hydra-agenda (:timeout 4)
    "org agenda"
    ("a" org-agenda "show agenda")
    ("t" org-set-tags-command "add tags")
    ("f" nil "finished" :exit t))

  (use-package undo-tree
    :hook (after-init . global-undo-tree-mode))

  ;; vim mode
  ;; N, I, V, R, 0, M, E state
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq
     ;; Keybindings
     evil-toggle-key "C-z"   ; use C-z to change to and from Emacs state
     evil-disable-insert-state-bindings nil
     evil-want-C-w-delete t  ; delete a word in insert state
     evil-want-C-u-scroll t  ; scroll up
     evil-want-C-d-scroll t  ; scroll down
     evil-want-C-i-jump nil
     ;; Search
     evil-search-module 'isearch
     ;; Indentation
     evil-shift-width 2
     ;; Cursor movement 
     ;; Cursor display
     ;; Window management
     evil-split-window-below t
     evil-vsplit-window-right t
     evil-undo-system 'undo-tree
     )

    :config
    (evil-mode 1)

    ;; normal mode map
    (evil-global-set-key 'normal "U" 'evil-redo)

    ;; motion mode map
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
  (use-package general
    :after evil
    :config
    (general-override-mode)
    (general-def
      :states 'normal
      :keymaps '(global override)
      "C-h" 'evil-window-left
      "C-j" 'evil-window-down
      "C-k" 'evil-window-up
      "C-l" 'evil-window-right
      )

    (general-create-definer leader
      :states 'normal
      :keymaps '(global override)
      :prefix "SPC")
    (leader "<SPC>" 'counsel-M-x
      "bb" 'counsel-switch-buffer
      "b>" 'next-buffer
      "b<" 'previous-buffer
      "ff" 'counsel-find-file
      "df" 'describe-function
      "dv" 'describe-variable
      "dk" 'describe-key
      "dd" 'dired-jump
      "gg" 'magit
      )

    (general-create-definer org_leader
      :states 'normal
      :keymaps '(org-mode-map override)
      :prefix "SPC")

    (org_leader "lp" 'org-latex-preview)
    ) 
#+end_src

* Which Key

[[https://github.com/justbur/emacs-which-key][which-key]] is a good libarary to provide some hints on the shortcut, for example, if we input =C-x=, it will toggle a UI panel to show all the commands which start with =C-x=.

#+begin_src emacs-lisp
  ;; give a hint on the shortcut
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src


* Ivy and Counsel

[[https://oremacs.com/swiper/][Ivy]] is an excellent completion framework for Emacs. It provides a minimal yet powerful selection menu that appears when you open files, switch buffers, and for many other tasks in Emacs. Counsel is a customized set of commands to replace `find-file` with `counsel-find-file`, etc which provide useful commands for each of the default completion commands.

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp
  ;; ivy: generic completion machanism
  ;; swiper: an ivy-enhanced alternative to isearch
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (setq ivy-use-virtual-buffers t
          ivy-count-format "(%d/%d) ")

    (ivy-mode 1))

  ;; counsel: a collection of ivy-enhanced versions of common Emacs commands
  (use-package counsel
    :bind ( :map minibuffer-local-map
            ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil))

  ;; ivy-rich: give description on the command, make ivy better
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

* Helpful

[[https://github.com/Wilfred/helpful][helpful]] gives a better document on almost everything in Emacs.

#+begin_src emacs-lisp
  ;; give a better doc
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

* Org Mode

[[https://orgmode.org/][Org Mode]] is one of the best modes in Emacs, It can make life easier.

** Org Babel

Org Babel allows us to evaluate code blocks in org file.

#+begin_src emacs-lisp
  (defun civ/org-babel-setup ()
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp .t)
       (python .t)
       (scheme .t)))

    (setq org-confirm-babel-evaluate nil)
    (setq org-babel-python-command "python"))
#+end_src

** Header Setting

#+begin_src emacs-lisp
  (defun civ/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; Set faces for heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "JetBrains Mono" :weight 'regular :height (cdr face))))
#+end_src

** Basic Config

This section contains the basic configuration for org-mode plus the configuration for Org agendas and capture templates.

#+begin_src emacs-lisp
  ;; org mode setting
  (defun civ/org-code-automatically-format ()
    "org code format"
    (interactive)
    (when (org-in-src-block-p)
      (org-edit-special)
      (indent-region (point-min) (point-max))
      (org-edit-src-exit)))

  (defun civ/org-mode-setup ()
    (org-indent-mode)
    (visual-line-mode 1)
    (setq org-src-tab-acts-natively t)
    (define-key org-mode-map
      (kbd "C-i") #'civ/org-code-automatically-format))

  ;; use org to organize your life
  (use-package org
    :hook (org-mode . civ/org-mode-setup)
    :config
    (setq org-ellipsis " ⌄")

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    ;; add org-habit, which enables us to show in agenda the STYLE
    ;; which value is habit
    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    ;; add org-tempo, which enables us to add some typical language
    ;; and its alias, to input the alias and <TAB>, we can generate
    ;; the code block quickly
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))

    ;; Save Org buffers after refiling!
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-src-tab-acts-natively t)
    (civ/org-font-setup)
    (civ/org-babel-setup))
#+end_src

** Nicer Bullets

[[https://github.com/sabof/org-bullets][org-bullets]] makes the heading stars better.

#+begin_src emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

